byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithObstacle/2D/src/constant/src/transportProperties.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (liquid1 liquid2);

liquid1
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

liquid2
{
    transportModel  Newtonian;
    nu              1.22543352601156e-5;
    rho             865;
}

sigma           0.0268;

transportModel  Newtonian;

rho             [1 -3 0 0 0 0 0]    1000;

nu              [0 2 -1 0 0 0 0]    1e-06;

// cellSizeDX      [0 1 0 0 0 0 0]     0;
// cellSizeDY      [0 1 0 0 0 0 0]     0;
// cellSizeDZ      [0 1 0 0 0 0 0]     0;

// ************************************************************************* //
