byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithObstacle/2D/src/system/snappyHexMeshSrc/eMeshList
{
    file "splittedChannel.eMesh";
    level 0;
}
