byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithObstacle/2D/src/system/snappyHexMeshSrc/refinementSurfacesList
splittedChannelWalls
{
    level (1 1);
    patchInfo{type wall;}
}
