byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithObstacle/2D/src/system/snappyHexMeshSrc/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surface1
{
    surfaces
    (
        "splittedChannel.stl"
    );

    // Identify a feature when angle between faces < includedAngle
    includedAngle   150;

    // Do not mark region edges
    geometricTestOnly       yes;

    // Write options

    // Write features to obj format for postprocessing
    writeObj                no;
    verboseObj              no;
}

// ************************************************************************* //
